{
  "name": "Basic Mathematics by Serge Lang",
  "description": "100 slides summarizing foundational topics from Serge Lang's 'Basic Mathematics'.",
  "slides": [
    {
      "title": "The Real Number System",
      "content": "<h1>The Real Number System</h1><ul><li>Overview and key concepts related to the real number system.</li><li>Examples and applications of the real number system in problem-solving.</li></ul>"
    },
    {
      "title": "Integers and Operations",
      "content": "<h1>Integers and Operations</h1><ul><li>Overview and key concepts related to integers and operations.</li><li>Examples and applications of integers and operations in problem-solving.</li></ul>"
    },
    {
      "title": "Fractions",
      "content": "<h1>Fractions</h1><ul><li>Overview and key concepts related to fractions.</li><li>Examples and applications of fractions in problem-solving.</li></ul>"
    },
    {
      "title": "Decimals",
      "content": "<h1>Decimals</h1><ul><li>Overview and key concepts related to decimals.</li><li>Examples and applications of decimals in problem-solving.</li></ul>"
    },
    {
      "title": "Percentages",
      "content": "<h1>Percentages</h1><ul><li>Overview and key concepts related to percentages.</li><li>Examples and applications of percentages in problem-solving.</li></ul>"
    },
    {
      "title": "Exponents and Powers",
      "content": "<h1>Exponents and Powers</h1><ul><li>Overview and key concepts related to exponents and powers.</li><li>Examples and applications of exponents and powers in problem-solving.</li></ul>"
    },
    {
      "title": "Roots and Radicals",
      "content": "<h1>Roots and Radicals</h1><ul><li>Overview and key concepts related to roots and radicals.</li><li>Examples and applications of roots and radicals in problem-solving.</li></ul>"
    },
    {
      "title": "Algebraic Expressions",
      "content": "<h1>Algebraic Expressions</h1><ul><li>Overview and key concepts related to algebraic expressions.</li><li>Examples and applications of algebraic expressions in problem-solving.</li></ul>"
    },
    {
      "title": "Linear Equations",
      "content": "<h1>Linear Equations</h1><ul><li>Overview and key concepts related to linear equations.</li><li>Examples and applications of linear equations in problem-solving.</li></ul>"
    },
    {
      "title": "Inequalities",
      "content": "<h1>Inequalities</h1><ul><li>Overview and key concepts related to inequalities.</li><li>Examples and applications of inequalities in problem-solving.</li></ul>"
    },
    {
      "title": "Absolute Value",
      "content": "<h1>Absolute Value</h1><ul><li>Overview and key concepts related to absolute value.</li><li>Examples and applications of absolute value in problem-solving.</li></ul>"
    },
    {
      "title": "Word Problems",
      "content": "<h1>Word Problems</h1><ul><li>Overview and key concepts related to word problems.</li><li>Examples and applications of word problems in problem-solving.</li></ul>"
    },
    {
      "title": "Ratios and Proportions",
      "content": "<h1>Ratios and Proportions</h1><ul><li>Overview and key concepts related to ratios and proportions.</li><li>Examples and applications of ratios and proportions in problem-solving.</li></ul>"
    },
    {
      "title": "Polynomials",
      "content": "<h1>Polynomials</h1><ul><li>Overview and key concepts related to polynomials.</li><li>Examples and applications of polynomials in problem-solving.</li></ul>"
    },
    {
      "title": "Factoring",
      "content": "<h1>Factoring</h1><ul><li>Overview and key concepts related to factoring.</li><li>Examples and applications of factoring in problem-solving.</li></ul>"
    },
    {
      "title": "Quadratic Equations",
      "content": "<h1>Quadratic Equations</h1><ul><li>Overview and key concepts related to quadratic equations.</li><li>Examples and applications of quadratic equations in problem-solving.</li></ul>"
    },
    {
      "title": "Coordinate Geometry",
      "content": "<h1>Coordinate Geometry</h1><ul><li>Overview and key concepts related to coordinate geometry.</li><li>Examples and applications of coordinate geometry in problem-solving.</li></ul>"
    },
    {
      "title": "Graphing Linear Equations",
      "content": "<h1>Graphing Linear Equations</h1><ul><li>Overview and key concepts related to graphing linear equations.</li><li>Examples and applications of graphing linear equations in problem-solving.</li></ul>"
    },
    {
      "title": "Functions and Relations",
      "content": "<h1>Functions and Relations</h1><ul><li>Overview and key concepts related to functions and relations.</li><li>Examples and applications of functions and relations in problem-solving.</li></ul>"
    },
    {
      "title": "Systems of Equations",
      "content": "<h1>Systems of Equations</h1><ul><li>Overview and key concepts related to systems of equations.</li><li>Examples and applications of systems of equations in problem-solving.</li></ul>"
    },
    {
      "title": "Irrational Numbers",
      "content": "<h1>Irrational Numbers</h1><ul><li>Overview and key concepts related to irrational numbers.</li><li>Examples and applications of irrational numbers in problem-solving.</li></ul>"
    },
    {
      "title": "Complex Numbers",
      "content": "<h1>Complex Numbers</h1><ul><li>Overview and key concepts related to complex numbers.</li><li>Examples and applications of complex numbers in problem-solving.</li></ul>"
    },
    {
      "title": "Scientific Notation",
      "content": "<h1>Scientific Notation</h1><ul><li>Overview and key concepts related to scientific notation.</li><li>Examples and applications of scientific notation in problem-solving.</li></ul>"
    },
    {
      "title": "Statistics Basics",
      "content": "<h1>Statistics Basics</h1><ul><li>Overview and key concepts related to statistics basics.</li><li>Examples and applications of statistics basics in problem-solving.</li></ul>"
    },
    {
      "title": "Probability",
      "content": "<h1>Probability</h1><ul><li>Overview and key concepts related to probability.</li><li>Examples and applications of probability in problem-solving.</li></ul>"
    },
    {
      "title": "Set Theory",
      "content": "<h1>Set Theory</h1><ul><li>Overview and key concepts related to set theory.</li><li>Examples and applications of set theory in problem-solving.</li></ul>"
    },
    {
      "title": "Logic and Reasoning",
      "content": "<h1>Logic and Reasoning</h1><ul><li>Overview and key concepts related to logic and reasoning.</li><li>Examples and applications of logic and reasoning in problem-solving.</li></ul>"
    },
    {
      "title": "Measurement",
      "content": "<h1>Measurement</h1><ul><li>Overview and key concepts related to measurement.</li><li>Examples and applications of measurement in problem-solving.</li></ul>"
    },
    {
      "title": "Units and Conversions",
      "content": "<h1>Units and Conversions</h1><ul><li>Overview and key concepts related to units and conversions.</li><li>Examples and applications of units and conversions in problem-solving.</li></ul>"
    },
    {
      "title": "Geometry Basics",
      "content": "<h1>Geometry Basics</h1><ul><li>Overview and key concepts related to geometry basics.</li><li>Examples and applications of geometry basics in problem-solving.</li></ul>"
    },
    {
      "title": "Angles and Their Properties",
      "content": "<h1>Angles and Their Properties</h1><ul><li>Overview and key concepts related to angles and their properties.</li><li>Examples and applications of angles and their properties in problem-solving.</li></ul>"
    },
    {
      "title": "Triangles",
      "content": "<h1>Triangles</h1><ul><li>Overview and key concepts related to triangles.</li><li>Examples and applications of triangles in problem-solving.</li></ul>"
    },
    {
      "title": "Quadrilaterals",
      "content": "<h1>Quadrilaterals</h1><ul><li>Overview and key concepts related to quadrilaterals.</li><li>Examples and applications of quadrilaterals in problem-solving.</li></ul>"
    },
    {
      "title": "Circles",
      "content": "<h1>Circles</h1><ul><li>Overview and key concepts related to circles.</li><li>Examples and applications of circles in problem-solving.</li></ul>"
    },
    {
      "title": "Area and Perimeter",
      "content": "<h1>Area and Perimeter</h1><ul><li>Overview and key concepts related to area and perimeter.</li><li>Examples and applications of area and perimeter in problem-solving.</li></ul>"
    },
    {
      "title": "Surface Area",
      "content": "<h1>Surface Area</h1><ul><li>Overview and key concepts related to surface area.</li><li>Examples and applications of surface area in problem-solving.</li></ul>"
    },
    {
      "title": "Volume",
      "content": "<h1>Volume</h1><ul><li>Overview and key concepts related to volume.</li><li>Examples and applications of volume in problem-solving.</li></ul>"
    },
    {
      "title": "Transformations",
      "content": "<h1>Transformations</h1><ul><li>Overview and key concepts related to transformations.</li><li>Examples and applications of transformations in problem-solving.</li></ul>"
    },
    {
      "title": "Symmetry",
      "content": "<h1>Symmetry</h1><ul><li>Overview and key concepts related to symmetry.</li><li>Examples and applications of symmetry in problem-solving.</li></ul>"
    },
    {
      "title": "Congruence and Similarity",
      "content": "<h1>Congruence and Similarity</h1><ul><li>Overview and key concepts related to congruence and similarity.</li><li>Examples and applications of congruence and similarity in problem-solving.</li></ul>"
    },
    {
      "title": "Trigonometry Basics",
      "content": "<h1>Trigonometry Basics</h1><ul><li>Overview and key concepts related to trigonometry basics.</li><li>Examples and applications of trigonometry basics in problem-solving.</li></ul>"
    },
    {
      "title": "Sine, Cosine, Tangent",
      "content": "<h1>Sine, Cosine, Tangent</h1><ul><li>Overview and key concepts related to sine, cosine, tangent.</li><li>Examples and applications of sine, cosine, tangent in problem-solving.</li></ul>"
    },
    {
      "title": "Applications of Trigonometry",
      "content": "<h1>Applications of Trigonometry</h1><ul><li>Overview and key concepts related to applications of trigonometry.</li><li>Examples and applications of applications of trigonometry in problem-solving.</li></ul>"
    },
    {
      "title": "Vectors",
      "content": "<h1>Vectors</h1><ul><li>Overview and key concepts related to vectors.</li><li>Examples and applications of vectors in problem-solving.</li></ul>"
    },
    {
      "title": "Matrices",
      "content": "<h1>Matrices</h1><ul><li>Overview and key concepts related to matrices.</li><li>Examples and applications of matrices in problem-solving.</li></ul>"
    },
    {
      "title": "Determinants",
      "content": "<h1>Determinants</h1><ul><li>Overview and key concepts related to determinants.</li><li>Examples and applications of determinants in problem-solving.</li></ul>"
    },
    {
      "title": "Sequences and Series",
      "content": "<h1>Sequences and Series</h1><ul><li>Overview and key concepts related to sequences and series.</li><li>Examples and applications of sequences and series in problem-solving.</li></ul>"
    },
    {
      "title": "Arithmetic Sequences",
      "content": "<h1>Arithmetic Sequences</h1><ul><li>Overview and key concepts related to arithmetic sequences.</li><li>Examples and applications of arithmetic sequences in problem-solving.</li></ul>"
    },
    {
      "title": "Geometric Sequences",
      "content": "<h1>Geometric Sequences</h1><ul><li>Overview and key concepts related to geometric sequences.</li><li>Examples and applications of geometric sequences in problem-solving.</li></ul>"
    },
    {
      "title": "Binomial Theorem",
      "content": "<h1>Binomial Theorem</h1><ul><li>Overview and key concepts related to binomial theorem.</li><li>Examples and applications of binomial theorem in problem-solving.</li></ul>"
    },
    {
      "title": "Limits Introduction",
      "content": "<h1>Limits Introduction</h1><ul><li>Overview and key concepts related to limits introduction.</li><li>Examples and applications of limits introduction in problem-solving.</li></ul>"
    },
    {
      "title": "Intro to Calculus",
      "content": "<h1>Intro to Calculus</h1><ul><li>Overview and key concepts related to intro to calculus.</li><li>Examples and applications of intro to calculus in problem-solving.</li></ul>"
    },
    {
      "title": "Linear Programming",
      "content": "<h1>Linear Programming</h1><ul><li>Overview and key concepts related to linear programming.</li><li>Examples and applications of linear programming in problem-solving.</li></ul>"
    },
    {
      "title": "Number Theory Basics",
      "content": "<h1>Number Theory Basics</h1><ul><li>Overview and key concepts related to number theory basics.</li><li>Examples and applications of number theory basics in problem-solving.</li></ul>"
    },
    {
      "title": "Divisibility Rules",
      "content": "<h1>Divisibility Rules</h1><ul><li>Overview and key concepts related to divisibility rules.</li><li>Examples and applications of divisibility rules in problem-solving.</li></ul>"
    },
    {
      "title": "Prime Numbers",
      "content": "<h1>Prime Numbers</h1><ul><li>Overview and key concepts related to prime numbers.</li><li>Examples and applications of prime numbers in problem-solving.</li></ul>"
    },
    {
      "title": "Greatest Common Divisor",
      "content": "<h1>Greatest Common Divisor</h1><ul><li>Overview and key concepts related to greatest common divisor.</li><li>Examples and applications of greatest common divisor in problem-solving.</li></ul>"
    },
    {
      "title": "Least Common Multiple",
      "content": "<h1>Least Common Multiple</h1><ul><li>Overview and key concepts related to least common multiple.</li><li>Examples and applications of least common multiple in problem-solving.</li></ul>"
    },
    {
      "title": "Modular Arithmetic",
      "content": "<h1>Modular Arithmetic</h1><ul><li>Overview and key concepts related to modular arithmetic.</li><li>Examples and applications of modular arithmetic in problem-solving.</li></ul>"
    },
    {
      "title": "Functions and Their Graphs",
      "content": "<h1>Functions and Their Graphs</h1><ul><li>Overview and key concepts related to functions and their graphs.</li><li>Examples and applications of functions and their graphs in problem-solving.</li></ul>"
    },
    {
      "title": "Inverse Functions",
      "content": "<h1>Inverse Functions</h1><ul><li>Overview and key concepts related to inverse functions.</li><li>Examples and applications of inverse functions in problem-solving.</li></ul>"
    },
    {
      "title": "Composite Functions",
      "content": "<h1>Composite Functions</h1><ul><li>Overview and key concepts related to composite functions.</li><li>Examples and applications of composite functions in problem-solving.</li></ul>"
    },
    {
      "title": "Parabolas",
      "content": "<h1>Parabolas</h1><ul><li>Overview and key concepts related to parabolas.</li><li>Examples and applications of parabolas in problem-solving.</li></ul>"
    },
    {
      "title": "Exponential Functions",
      "content": "<h1>Exponential Functions</h1><ul><li>Overview and key concepts related to exponential functions.</li><li>Examples and applications of exponential functions in problem-solving.</li></ul>"
    },
    {
      "title": "Logarithmic Functions",
      "content": "<h1>Logarithmic Functions</h1><ul><li>Overview and key concepts related to logarithmic functions.</li><li>Examples and applications of logarithmic functions in problem-solving.</li></ul>"
    },
    {
      "title": "Basic Derivatives",
      "content": "<h1>Basic Derivatives</h1><ul><li>Overview and key concepts related to basic derivatives.</li><li>Examples and applications of basic derivatives in problem-solving.</li></ul>"
    },
    {
      "title": "Basic Integrals",
      "content": "<h1>Basic Integrals</h1><ul><li>Overview and key concepts related to basic integrals.</li><li>Examples and applications of basic integrals in problem-solving.</li></ul>"
    },
    {
      "title": "Applications of Derivatives",
      "content": "<h1>Applications of Derivatives</h1><ul><li>Overview and key concepts related to applications of derivatives.</li><li>Examples and applications of applications of derivatives in problem-solving.</li></ul>"
    },
    {
      "title": "Applications of Integrals",
      "content": "<h1>Applications of Integrals</h1><ul><li>Overview and key concepts related to applications of integrals.</li><li>Examples and applications of applications of integrals in problem-solving.</li></ul>"
    },
    {
      "title": "Probability Distributions",
      "content": "<h1>Probability Distributions</h1><ul><li>Overview and key concepts related to probability distributions.</li><li>Examples and applications of probability distributions in problem-solving.</li></ul>"
    },
    {
      "title": "Combinations and Permutations",
      "content": "<h1>Combinations and Permutations</h1><ul><li>Overview and key concepts related to combinations and permutations.</li><li>Examples and applications of combinations and permutations in problem-solving.</li></ul>"
    },
    {
      "title": "Normal Distribution",
      "content": "<h1>Normal Distribution</h1><ul><li>Overview and key concepts related to normal distribution.</li><li>Examples and applications of normal distribution in problem-solving.</li></ul>"
    },
    {
      "title": "Z-Scores",
      "content": "<h1>Z-Scores</h1><ul><li>Overview and key concepts related to z-scores.</li><li>Examples and applications of z-scores in problem-solving.</li></ul>"
    },
    {
      "title": "Box Plots",
      "content": "<h1>Box Plots</h1><ul><li>Overview and key concepts related to box plots.</li><li>Examples and applications of box plots in problem-solving.</li></ul>"
    },
    {
      "title": "Histograms",
      "content": "<h1>Histograms</h1><ul><li>Overview and key concepts related to histograms.</li><li>Examples and applications of histograms in problem-solving.</li></ul>"
    },
    {
      "title": "Scatter Plots",
      "content": "<h1>Scatter Plots</h1><ul><li>Overview and key concepts related to scatter plots.</li><li>Examples and applications of scatter plots in problem-solving.</li></ul>"
    },
    {
      "title": "Correlation and Regression",
      "content": "<h1>Correlation and Regression</h1><ul><li>Overview and key concepts related to correlation and regression.</li><li>Examples and applications of correlation and regression in problem-solving.</li></ul>"
    },
    {
      "title": "Data Analysis",
      "content": "<h1>Data Analysis</h1><ul><li>Overview and key concepts related to data analysis.</li><li>Examples and applications of data analysis in problem-solving.</li></ul>"
    },
    {
      "title": "Error Analysis",
      "content": "<h1>Error Analysis</h1><ul><li>Overview and key concepts related to error analysis.</li><li>Examples and applications of error analysis in problem-solving.</li></ul>"
    },
    {
      "title": "Dimensional Analysis",
      "content": "<h1>Dimensional Analysis</h1><ul><li>Overview and key concepts related to dimensional analysis.</li><li>Examples and applications of dimensional analysis in problem-solving.</li></ul>"
    },
    {
      "title": "Problem Solving Strategies",
      "content": "<h1>Problem Solving Strategies</h1><ul><li>Overview and key concepts related to problem solving strategies.</li><li>Examples and applications of problem solving strategies in problem-solving.</li></ul>"
    },
    {
      "title": "Critical Thinking in Math",
      "content": "<h1>Critical Thinking in Math</h1><ul><li>Overview and key concepts related to critical thinking in math.</li><li>Examples and applications of critical thinking in math in problem-solving.</li></ul>"
    },
    {
      "title": "Math in Real Life",
      "content": "<h1>Math in Real Life</h1><ul><li>Overview and key concepts related to math in real life.</li><li>Examples and applications of math in real life in problem-solving.</li></ul>"
    },
    {
      "title": "Financial Mathematics",
      "content": "<h1>Financial Mathematics</h1><ul><li>Overview and key concepts related to financial mathematics.</li><li>Examples and applications of financial mathematics in problem-solving.</li></ul>"
    },
    {
      "title": "Interest Rates",
      "content": "<h1>Interest Rates</h1><ul><li>Overview and key concepts related to interest rates.</li><li>Examples and applications of interest rates in problem-solving.</li></ul>"
    },
    {
      "title": "Loan Calculations",
      "content": "<h1>Loan Calculations</h1><ul><li>Overview and key concepts related to loan calculations.</li><li>Examples and applications of loan calculations in problem-solving.</li></ul>"
    },
    {
      "title": "Savings and Investments",
      "content": "<h1>Savings and Investments</h1><ul><li>Overview and key concepts related to savings and investments.</li><li>Examples and applications of savings and investments in problem-solving.</li></ul>"
    },
    {
      "title": "Taxes and Budgets",
      "content": "<h1>Taxes and Budgets</h1><ul><li>Overview and key concepts related to taxes and budgets.</li><li>Examples and applications of taxes and budgets in problem-solving.</li></ul>"
    },
    {
      "title": "Introduction to Programming Logic",
      "content": "<h1>Introduction to Programming Logic</h1><ul><li>Overview and key concepts related to introduction to programming logic.</li><li>Examples and applications of introduction to programming logic in problem-solving.</li></ul>"
    },
    {
      "title": "Algorithms in Math",
      "content": "<h1>Algorithms in Math</h1><ul><li>Overview and key concepts related to algorithms in math.</li><li>Examples and applications of algorithms in math in problem-solving.</li></ul>"
    },
    {
      "title": "Math and Computer Science",
      "content": "<h1>Math and Computer Science</h1><ul><li>Overview and key concepts related to math and computer science.</li><li>Examples and applications of math and computer science in problem-solving.</li></ul>"
    },
    {
      "title": "Math and Physics",
      "content": "<h1>Math and Physics</h1><ul><li>Overview and key concepts related to math and physics.</li><li>Examples and applications of math and physics in problem-solving.</li></ul>"
    },
    {
      "title": "Math and Engineering",
      "content": "<h1>Math and Engineering</h1><ul><li>Overview and key concepts related to math and engineering.</li><li>Examples and applications of math and engineering in problem-solving.</li></ul>"
    },
    {
      "title": "Math and Economics",
      "content": "<h1>Math and Economics</h1><ul><li>Overview and key concepts related to math and economics.</li><li>Examples and applications of math and economics in problem-solving.</li></ul>"
    },
    {
      "title": "Math and Statistics",
      "content": "<h1>Math and Statistics</h1><ul><li>Overview and key concepts related to math and statistics.</li><li>Examples and applications of math and statistics in problem-solving.</li></ul>"
    },
    {
      "title": "Mathematical Modeling",
      "content": "<h1>Mathematical Modeling</h1><ul><li>Overview and key concepts related to mathematical modeling.</li><li>Examples and applications of mathematical modeling in problem-solving.</li></ul>"
    },
    {
      "title": "Research in Mathematics",
      "content": "<h1>Research in Mathematics</h1><ul><li>Overview and key concepts related to research in mathematics.</li><li>Examples and applications of research in mathematics in problem-solving.</li></ul>"
    },
    {
      "title": "Careers in Mathematics",
      "content": "<h1>Careers in Mathematics</h1><ul><li>Overview and key concepts related to careers in mathematics.</li><li>Examples and applications of careers in mathematics in problem-solving.</li></ul>"
    },
    {
      "title": "Conclusion and Summary",
      "content": "<h1>Conclusion and Summary</h1><ul><li>Overview and key concepts related to conclusion and summary.</li><li>Examples and applications of conclusion and summary in problem-solving.</li></ul>"
    }
  ]
}